In [1]:
import pandas as pd
import datetime as dt
from ast import literal_eval

In [2]:
pd.set_option("display.max_columns", None)
pd.set_option('display.max_colwidth', 100)
pd.options.display.float_format = '{:,.2f}'.format

In [3]:
df = pd.read_csv('VinIDRecruitChallenge_MLTrack_DataSet.csv')
df['date'] = pd.to_datetime(df.date)
df

,csn,date,transaction_info
0,Y2NgaWJoYw==,2018-03-02,"[{'article': '10020163', 'salesquantity': 2.0, 'price': 18250.0}]"
1,Y2NgaWJoYw==,2018-03-04,"[{'article': '10026562', 'salesquantity': 3.0, 'price': 13000.0}, {'article': '10320883', 'sales..."
2,Y2NgaWlpYA==,2018-02-27,"[{'article': '10013531', 'salesquantity': 1.0, 'price': 17800.0}, {'article': '10015613', 'sales..."
3,Y2NgaWlpYA==,2018-03-16,"[{'article': '10008991', 'salesquantity': 1.0, 'price': 57000.0}, {'article': '10010168', 'sales..."
4,Y2NgaWlpYA==,2018-05-24,"[{'article': '10009698', 'salesquantity': 1.0, 'price': 48900.0}, {'article': '10009701', 'sales..."
...,...,...,...
131789,amxpamJk,2018-03-24,"[{'article': '10324916', 'salesquantity': 1.0, 'price': 29700.0}, {'article': '10314277', 'sales..."
131790,amxpamJk,2018-04-07,"[{'article': '10012785', 'salesquantity': 1.0, 'price': 48000.0}, {'article': '10019005', 'sales..."
131791,amxpamJk,2018-04-21,"[{'article': '10083185', 'salesquantity': 1.0, 'price': 7000.0}, {'article': '10053361', 'salesq..."
131792,amxpamJk,2018-05-20,"[{'article': '10054789', 'salesquantity': 0.506, 'price': 38899.21}, {'article': '10053664', 'sa..."
131793,amxpbWNk,2018-04-11,"[{'article': '10016399', 'salesquantity': 2.0, 'price': 57700.0}, {'article': '10016834', 'sales..."

In [4]:
df['transaction_info'] = df['transaction_info'].apply(literal_eval) #convert to list type
df = df.explode('transaction_info')
df

,csn,date,transaction_info
0,Y2NgaWJoYw==,2018-03-02,"{'article': '10020163', 'salesquantity': 2.0, 'price': 18250.0}"
1,Y2NgaWJoYw==,2018-03-04,"{'article': '10026562', 'salesquantity': 3.0, 'price': 13000.0}"
1,Y2NgaWJoYw==,2018-03-04,"{'article': '10320883', 'salesquantity': 2.0, 'price': 43000.0}"
2,Y2NgaWlpYA==,2018-02-27,"{'article': '10013531', 'salesquantity': 1.0, 'price': 17800.0}"
2,Y2NgaWlpYA==,2018-02-27,"{'article': '10015613', 'salesquantity': 1.0, 'price': 5600.0}"
...,...,...,...
131792,amxpamJk,2018-05-20,"{'article': '10225636', 'salesquantity': 0.182, 'price': 51500.0}"
131793,amxpbWNk,2018-04-11,"{'article': '10016399', 'salesquantity': 2.0, 'price': 57700.0}"
131793,amxpbWNk,2018-04-11,"{'article': '10016834', 'salesquantity': 1.0, 'price': 97000.0}"
131793,amxpbWNk,2018-04-11,"{'article': '10018739', 'salesquantity': 1.0, 'price': 82500.0}"
131793,amxpbWNk,2018-04-11,"{'article': '10033742', 'salesquantity': 1.0, 'price': 10500.0}"

In [5]:
df = pd.concat([df.reset_index(drop=True), pd.DataFrame(list(df.transaction_info)).reset_index()], axis=1)
df = df.drop(columns=['transaction_info'])
df

                 csn       date   index   article  salesquantity     price
0       Y2NgaWJoYw== 2018-03-02       0  10020163           2.00 18,250.00
1       Y2NgaWJoYw== 2018-03-04       1  10026562           3.00 13,000.00
2       Y2NgaWJoYw== 2018-03-04       2  10320883           2.00 43,000.00
3       Y2NgaWlpYA== 2018-02-27       3  10013531           1.00 17,800.00
4       Y2NgaWlpYA== 2018-02-27       4  10015613           1.00  5,600.00
...              ...        ...     ...       ...            ...       ...
993507      amxpamJk 2018-05-20  993507  10225636           0.18 51,500.00
993508      amxpbWNk 2018-04-11  993508  10016399           2.00 57,700.00
993509      amxpbWNk 2018-04-11  993509  10016834           1.00 97,000.00
993510      amxpbWNk 2018-04-11  993510  10018739           1.00 82,500.00
993511      amxpbWNk 2018-04-11  993511  10033742           1.00 10,500.00

[993512 rows x 6 columns]

In [6]:
df['value'] = df.salesquantity * df.price

In [7]:
df = df.groupby(['date', 'csn']).agg(article= ('article', 'count'),
                                salesquantity = ('salesquantity', 'sum'),
                                value = ('value', 'sum')).reset_index()
df = df.sort_values(['csn', 'date'])
df['prev_date'] = df.groupby('csn')['date'].shift()
df['days_btw_trans'] = (df['date'] - df['prev_date']).dt.days
df['days_left_in_month'] = df['date'].dt.daysinmonth - df['date'].dt.day
df['month'] = df.date.dt.month
df

,date,csn,article,salesquantity,value,prev_date,days_btw_trans,days_left_in_month,month
26063,2018-03-02,Y2NgaWJoYw==,1,2.00,"36,500.00",NaT,NaN,29,3
27787,2018-03-04,Y2NgaWJoYw==,2,5.00,"125,000.00",2018-03-02,2.00,27,3
23604,2018-02-27,Y2NgaWlpYA==,17,27.00,"1,423,700.00",NaT,NaN,1,2
38122,2018-03-16,Y2NgaWlpYA==,5,6.00,"668,000.00",2018-02-27,17.00,15,3
98161,2018-05-24,Y2NgaWlpYA==,4,9.00,"485,800.00",2018-03-16,69.00,7,5
...,...,...,...,...,...,...,...,...,...
46001,2018-03-24,amxpamJk,4,4.00,"135,000.00",2018-02-11,41.00,7,3
58005,2018-04-07,amxpamJk,2,4.00,"195,000.00",2018-03-24,14.00,23,4
69910,2018-04-21,amxpamJk,9,8.17,"291,183.00",2018-04-07,14.00,9,4
95809,2018-05-20,amxpamJk,12,14.34,"327,044.00",2018-04-21,29.00,11,5
61304,2018-04-11,amxpbWNk,4,5.00,"305,400.00",NaT,NaN,19,4

In [29]:
train_data = df.groupby(['csn', 'month']).agg({'article': ['sum', 'min', 'max'],
                                  'salesquantity': ['sum', 'min', 'max'],
                                  'value': ['sum', 'min', 'max'],
                                  'days_btw_trans': ['mean', 'min', 'max'],
                                  'days_left_in_month': ['last']})
train_data.columns = ['_'.join(gp) for gp in train_data.columns.values]
train_data = train_data.reset_index()
train_data

,csn,month,article_sum,article_min,article_max,salesquantity_sum,salesquantity_min,salesquantity_max,value_sum,value_min,value_max,days_btw_trans_mean,days_btw_trans_min,days_btw_trans_max,days_left_in_month_last
0,Y2NgaWJoYw==,3,3,1,2,7.00,2.00,5.00,"161,500.00","36,500.00","125,000.00",2.00,2.00,2.00,27
1,Y2NgaWlpYA==,2,17,17,17,27.00,27.00,27.00,"1,423,700.00","1,423,700.00","1,423,700.00",NaN,NaN,NaN,1
2,Y2NgaWlpYA==,3,5,5,5,6.00,6.00,6.00,"668,000.00","668,000.00","668,000.00",17.00,17.00,17.00,15
3,Y2NgaWlpYA==,5,4,4,4,9.00,9.00,9.00,"485,800.00","485,800.00","485,800.00",69.00,69.00,69.00,7
4,Y2NgamRpZA==,2,31,4,16,34.57,4.00,20.14,"1,156,347.00","116,200.00","387,318.00",8.33,3.00,18.00,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
46307,amxpamJk,2,25,3,22,25.00,3.00,22.00,"1,301,700.00","221,200.00","1,080,500.00",8.00,8.00,8.00,17
46308,amxpamJk,3,4,4,4,4.00,4.00,4.00,"135,000.00","135,000.00","135,000.00",41.00,41.00,41.00,7
46309,amxpamJk,4,11,2,9,12.17,4.00,8.17,"486,183.00","195,000.00","291,183.00",14.00,14.00,14.00,9
46310,amxpamJk,5,12,12,12,14.34,14.34,14.34,"327,044.00","327,044.00","327,044.00",29.00,29.00,29.00,11
46311,amxpbWNk,4,4,4,4,5.00,5.00,5.00,"305,400.00","305,400.00","305,400.00",NaN,NaN,NaN,19

                    article  salesquantity
csn          month
Y2NgaWJoYw== 3            2           5.00
Y2NgaWlpYA== 2           17          27.00
             3            5           6.00
             5            4           9.00
Y2NgamRpZA== 2           16          20.14
...                     ...            ...
amxpamJk     2           22          22.00
             3            4           4.00
             4            9           8.17
             5           12          14.34
amxpbWNk     4            4           5.00

[46312 rows x 2 columns]